bivex/ArchC/tests/esp32/esp32_arch.H
/******************************************************
 * ArchC Resources header file.                       *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef  ESP32_ARCH_H
#define  ESP32_ARCH_H

#include  "esp32_parms.H"
#include  "ac_arch_dec_if.H"
#include  "ac_mem.H"
#include  "ac_memport.H"
#include  "ac_regbank.H"
#include  "ac_reg.H"
 
//!ArchC class for model-specific architectural resources.

class esp32_arch : public ac_arch_dec_if<esp32_parms::ac_word, esp32_parms::ac_Hword> {
public:

  //!Program Counter.
  ac_reg<unsigned> ac_pc;

  //!Processor id.
  ac_reg<unsigned> ac_id;

  //!Storage Devices.
  ac_mem IROM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword> IROM_mport;
  ac_mem IRAM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword> IRAM_mport;
  ac_mem DRAM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword> DRAM_mport;
  ac_mem PSRAM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword> PSRAM_mport;
  ac_mem DM;
  ac_memport<esp32_parms::ac_word, esp32_parms::ac_Hword> DM_mport;
  ac_regbank<16, esp32_parms::ac_word, esp32_parms::ac_Dword> AR;
  ac_reg<esp32_parms::ac_word> sar;
  ac_reg<esp32_parms::ac_word> lcount;
  ac_reg<esp32_parms::ac_word> lbeg;
  ac_reg<esp32_parms::ac_word> lend;
  ac_reg<esp32_parms::ac_word> ps;


  //!Constructor.
  explicit esp32_arch();

  //!Module initialization method.
  virtual void init(int ac, char* av[]) = 0;

  //!Module finalization method.
  virtual void stop(int status = 0) = 0;

  //!Virtual destructor declaration.
  virtual ~esp32_arch() {};

  static int globalId;
  int getId() { return ac_id.read(); }
};

#endif  //_ESP32_ARCH_H
